# Pengelolaan dasar _database_ SQLite dengan python 3

by **Sigit Sumarsono** \(
[@Sumarsono](www.github.com/sumarsono) 
or @gitsumarsono \)

## Mengenal SQLite

SQLite adalah salah satu implementasi _Standard Query Language_ yang dibuat dengan bahasa pemrograman C. Berbeda dengan SQL lainnya, SQLite bukan merupakan SQL berbasis _Client-Server_ sehingga SQLite sangat ringan tidak memerlukan konfigurasi dalam penggunaannya. Anda cukup membuka menggunakanan aplikasi yang mendukung semisal [DB Browser for SQLite](https://sqlitebrowser.org/). Anda juga dapat menggunakan bahasa pemrograman python untuk mengolah _database_ dengan bantuan library _sqlite3_ yang umumnya sudah terinstall bersamaan ketika anda menginstall python 3.

## Mempersiapkan Library Python

In [1]:
# import library sqlite3
import sqlite3

# menyiapkan koneksi untuk membuat database bernama 'example.db' dalam folder 'data'
connection = sqlite3.connect('data/example.db')

# membuat antarmuka 'cursor' untuk mempersingkat penulisan kode
cursor = connection.cursor()

## CRUD database SQLite menggunakan Python

### Membuat Tabel Baru

Disini kita akan membuat tabel **nilai** dengan rancangan _field_ sebagai berikut:

|_Field_|_Type_|_Value_|
|:------|:----:|:------|
|**id**|_Integer_|_Primary Key, Auto-increment_|
|**nama**|_Text_| |
|**gender**|_Text_| |
|**nilai**|_Integer_| |

In [2]:
# membuat tabel baru bernama 'nilai'
cursor.execute(
'''CREATE TABLE nilai(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nama TEXT NOT NULL,
    gender TEXT NOT NULL,
    nilai INTEGER NOT NULL
);''')

# commit update (wajib dilakukan, jika tidak database tidak akan berubah)
connection.commit()

### Memasukkan _record_ data ke dalam tabel

**Perhatian!** \
Untuk memasukkan record ke dalam tabel, operasi `.execute()` hanya dapat dilakukan sekali untuk setiap _record_

In [3]:
# memasukkan record ke dalam tabel
# PS : backspace digunakan untuk memecah perintah menjadi 2 baris
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Alice','Wanita','90')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Bob','Pria','80')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Chuck','Pria','50')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Dan','Pria','70')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Eve','Wanita','50')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Faythe','Wanita','100')''')
cursor.execute('''INSERT INTO nilai ('nama','gender','nilai') \
                VALUES ('Grace','Wanita','70')''')


# jangan lupa commit
connection.commit()

### Menghapus _Record_

In [4]:
# Berdasarkan id
cursor.execute('''DELETE FROM nilai WHERE id = 1''')

# Berdasarkan field lain
cursor.execute('''DELETE FROM nilai WHERE nama = "Alice"''')
               
# jangan lupa commit
connection.commit()

### Mengubah _Record_

In [5]:
# mengubah nilai Bob
cursor.execute('''UPDATE nilai SET nilai = 75 WHERE nama = "Bob"''')

# jangan lupa commit
connection.commit()

### Membaca Database menggunakan Pandas

Untuk membaca tabel yang telah kita buat, kita dapat menggunakan bantuan _library_ **pandas** agar data terlihat lebih rapi serta mempermudah proses pengolahan data.

In [6]:
# impor pandas
import pandas as pd

# memasukkan tabel nilai ke dalam array
nilai = pd.read_sql_query('''SELECT * FROM nilai''', connection)

# cek hasil keluaran
nilai.head(3)

   id   nama gender  nilai
0   2    Bob   Pria     75
1   3  Chuck   Pria     50
2   4    Dan   Pria     70

In [7]:
# atau untuk melihat keseluruhan tabel
nilai

   id    nama  gender  nilai
0   2     Bob    Pria     75
1   3   Chuck    Pria     50
2   4     Dan    Pria     70
3   5     Eve  Wanita     50
4   6  Faythe  Wanita    100
5   7   Grace  Wanita     70